zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FCCU.h
#define FCCU_NCFS_CFG_NCFSC13_MASK               (0xC000000U)
#define FCCU_NCFS_CFG_NCFSC13_SHIFT              (26U)
#define FCCU_NCFS_CFG_NCFSC13_WIDTH              (2U)
#define FCCU_NCFS_CFG_NCFSC13(x)                 (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC13_SHIFT)) & FCCU_NCFS_CFG_NCFSC13_MASK)

#define FCCU_NCFS_CFG_NCFSC14_MASK               (0x30000000U)
#define FCCU_NCFS_CFG_NCFSC14_SHIFT              (28U)
#define FCCU_NCFS_CFG_NCFSC14_WIDTH              (2U)
#define FCCU_NCFS_CFG_NCFSC14(x)                 (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC14_SHIFT)) & FCCU_NCFS_CFG_NCFSC14_MASK)

#define FCCU_NCFS_CFG_NCFSC15_MASK               (0xC0000000U)
#define FCCU_NCFS_CFG_NCFSC15_SHIFT              (30U)
#define FCCU_NCFS_CFG_NCFSC15_WIDTH              (2U)
#define FCCU_NCFS_CFG_NCFSC15(x)                 (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC15_SHIFT)) & FCCU_NCFS_CFG_NCFSC15_MASK)
/*! @} */

/*! @name NCF_S - Non-critical Fault Status */
/*! @{ */

#define FCCU_NCF_S_NCFS0_MASK                    (0x1U)
#define FCCU_NCF_S_NCFS0_SHIFT                   (0U)
#define FCCU_NCF_S_NCFS0_WIDTH                   (1U)
#define FCCU_NCF_S_NCFS0(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS0_SHIFT)) & FCCU_NCF_S_NCFS0_MASK)

#define FCCU_NCF_S_NCFS1_MASK                    (0x2U)
#define FCCU_NCF_S_NCFS1_SHIFT                   (1U)
#define FCCU_NCF_S_NCFS1_WIDTH                   (1U)
#define FCCU_NCF_S_NCFS1(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS1_SHIFT)) & FCCU_NCF_S_NCFS1_MASK)

#define FCCU_NCF_S_NCFS2_MASK                    (0x4U)
#define FCCU_NCF_S_NCFS2_SHIFT                   (2U)
#define FCCU_NCF_S_NCFS2_WIDTH                   (1U)
#define FCCU_NCF_S_NCFS2(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS2_SHIFT)) & FCCU_NCF_S_NCFS2_MASK)

#define FCCU_NCF_S_NCFS3_MASK                    (0x8U)
#define FCCU_NCF_S_NCFS3_SHIFT                   (3U)
#define FCCU_NCF_S_NCFS3_WIDTH                   (1U)
#define FCCU_NCF_S_NCFS3(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS3_SHIFT)) & FCCU_NCF_S_NCFS3_MASK)

#define FCCU_NCF_S_NCFS4_MASK                    (0x10U)
#define FCCU_NCF_S_NCFS4_SHIFT                   (4U)
#define FCCU_NCF_S_NCFS4_WIDTH                   (1U)
#define FCCU_NCF_S_NCFS4(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS4_SHIFT)) & FCCU_NCF_S_NCFS4_MASK)

#define FCCU_NCF_S_NCFS5_MASK                    (0x20U)
#define FCCU_NCF_S_NCFS5_SHIFT                   (5U)
#define FCCU_NCF_S_NCFS5_WIDTH                   (1U)
#define FCCU_NCF_S_NCFS5(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS5_SHIFT)) & FCCU_NCF_S_NCFS5_MASK)

#define FCCU_NCF_S_NCFS6_MASK                    (0x40U)
#define FCCU_NCF_S_NCFS6_SHIFT                   (6U)
#define FCCU_NCF_S_NCFS6_WIDTH                   (1U)
#define FCCU_NCF_S_NCFS6(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS6_SHIFT)) & FCCU_NCF_S_NCFS6_MASK)

#define FCCU_NCF_S_NCFS7_MASK                    (0x80U)
#define FCCU_NCF_S_NCFS7_SHIFT                   (7U)
#define FCCU_NCF_S_NCFS7_WIDTH                   (1U)
#define FCCU_NCF_S_NCFS7(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS7_SHIFT)) & FCCU_NCF_S_NCFS7_MASK)

#define FCCU_NCF_S_NCFS8_MASK                    (0x100U)
#define FCCU_NCF_S_NCFS8_SHIFT                   (8U)
#define FCCU_NCF_S_NCFS8_WIDTH                   (1U)
#define FCCU_NCF_S_NCFS8(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS8_SHIFT)) & FCCU_NCF_S_NCFS8_MASK)

#define FCCU_NCF_S_NCFS9_MASK                    (0x200U)
#define FCCU_NCF_S_NCFS9_SHIFT                   (9U)
#define FCCU_NCF_S_NCFS9_WIDTH                   (1U)
#define FCCU_NCF_S_NCFS9(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS9_SHIFT)) & FCCU_NCF_S_NCFS9_MASK)

#define FCCU_NCF_S_NCFS10_MASK                   (0x400U)
#define FCCU_NCF_S_NCFS10_SHIFT                  (10U)
#define FCCU_NCF_S_NCFS10_WIDTH                  (1U)
#define FCCU_NCF_S_NCFS10(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS10_SHIFT)) & FCCU_NCF_S_NCFS10_MASK)

#define FCCU_NCF_S_NCFS11_MASK                   (0x800U)
#define FCCU_NCF_S_NCFS11_SHIFT                  (11U)
#define FCCU_NCF_S_NCFS11_WIDTH                  (1U)
#define FCCU_NCF_S_NCFS11(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS11_SHIFT)) & FCCU_NCF_S_NCFS11_MASK)

#define FCCU_NCF_S_NCFS12_MASK                   (0x1000U)
#define FCCU_NCF_S_NCFS12_SHIFT                  (12U)
#define FCCU_NCF_S_NCFS12_WIDTH                  (1U)
#define FCCU_NCF_S_NCFS12(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS12_SHIFT)) & FCCU_NCF_S_NCFS12_MASK)

#define FCCU_NCF_S_NCFS13_MASK                   (0x2000U)
#define FCCU_NCF_S_NCFS13_SHIFT                  (13U)
#define FCCU_NCF_S_NCFS13_WIDTH                  (1U)
#define FCCU_NCF_S_NCFS13(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS13_SHIFT)) & FCCU_NCF_S_NCFS13_MASK)

#define FCCU_NCF_S_NCFS14_MASK                   (0x4000U)
#define FCCU_NCF_S_NCFS14_SHIFT                  (14U)
#define FCCU_NCF_S_NCFS14_WIDTH                  (1U)
#define FCCU_NCF_S_NCFS14(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS14_SHIFT)) & FCCU_NCF_S_NCFS14_MASK)

#define FCCU_NCF_S_NCFS15_MASK                   (0x8000U)
#define FCCU_NCF_S_NCFS15_SHIFT                  (15U)
#define FCCU_NCF_S_NCFS15_WIDTH                  (1U)
#define FCCU_NCF_S_NCFS15(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_S_NCFS15_SHIFT)) & FCCU_NCF_S_NCFS15_MASK)
/*! @} */

/*! @name NCFK - Non-critical Fault Key */
/*! @{ */

#define FCCU_NCFK_NCFK_MASK                      (0xFFFFFFFFU)
#define FCCU_NCFK_NCFK_SHIFT                     (0U)
#define FCCU_NCFK_NCFK_WIDTH                     (32U)
#define FCCU_NCFK_NCFK(x)                        (((uint32_t)(((uint32_t)(x)) << FCCU_NCFK_NCFK_SHIFT)) & FCCU_NCFK_NCFK_MASK)
/*! @} */

