zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FCCU.h
/*! @name NCF_E - Non-critical Fault Enable */
/*! @{ */

#define FCCU_NCF_E_NCFE0_MASK                    (0x1U)
#define FCCU_NCF_E_NCFE0_SHIFT                   (0U)
#define FCCU_NCF_E_NCFE0_WIDTH                   (1U)
#define FCCU_NCF_E_NCFE0(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE0_SHIFT)) & FCCU_NCF_E_NCFE0_MASK)

#define FCCU_NCF_E_NCFE1_MASK                    (0x2U)
#define FCCU_NCF_E_NCFE1_SHIFT                   (1U)
#define FCCU_NCF_E_NCFE1_WIDTH                   (1U)
#define FCCU_NCF_E_NCFE1(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE1_SHIFT)) & FCCU_NCF_E_NCFE1_MASK)

#define FCCU_NCF_E_NCFE2_MASK                    (0x4U)
#define FCCU_NCF_E_NCFE2_SHIFT                   (2U)
#define FCCU_NCF_E_NCFE2_WIDTH                   (1U)
#define FCCU_NCF_E_NCFE2(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE2_SHIFT)) & FCCU_NCF_E_NCFE2_MASK)

#define FCCU_NCF_E_NCFE3_MASK                    (0x8U)
#define FCCU_NCF_E_NCFE3_SHIFT                   (3U)
#define FCCU_NCF_E_NCFE3_WIDTH                   (1U)
#define FCCU_NCF_E_NCFE3(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE3_SHIFT)) & FCCU_NCF_E_NCFE3_MASK)

#define FCCU_NCF_E_NCFE4_MASK                    (0x10U)
#define FCCU_NCF_E_NCFE4_SHIFT                   (4U)
#define FCCU_NCF_E_NCFE4_WIDTH                   (1U)
#define FCCU_NCF_E_NCFE4(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE4_SHIFT)) & FCCU_NCF_E_NCFE4_MASK)

#define FCCU_NCF_E_NCFE5_MASK                    (0x20U)
#define FCCU_NCF_E_NCFE5_SHIFT                   (5U)
#define FCCU_NCF_E_NCFE5_WIDTH                   (1U)
#define FCCU_NCF_E_NCFE5(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE5_SHIFT)) & FCCU_NCF_E_NCFE5_MASK)

#define FCCU_NCF_E_NCFE6_MASK                    (0x40U)
#define FCCU_NCF_E_NCFE6_SHIFT                   (6U)
#define FCCU_NCF_E_NCFE6_WIDTH                   (1U)
#define FCCU_NCF_E_NCFE6(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE6_SHIFT)) & FCCU_NCF_E_NCFE6_MASK)

#define FCCU_NCF_E_NCFE7_MASK                    (0x80U)
#define FCCU_NCF_E_NCFE7_SHIFT                   (7U)
#define FCCU_NCF_E_NCFE7_WIDTH                   (1U)
#define FCCU_NCF_E_NCFE7(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE7_SHIFT)) & FCCU_NCF_E_NCFE7_MASK)

#define FCCU_NCF_E_NCFE8_MASK                    (0x100U)
#define FCCU_NCF_E_NCFE8_SHIFT                   (8U)
#define FCCU_NCF_E_NCFE8_WIDTH                   (1U)
#define FCCU_NCF_E_NCFE8(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE8_SHIFT)) & FCCU_NCF_E_NCFE8_MASK)

#define FCCU_NCF_E_NCFE9_MASK                    (0x200U)
#define FCCU_NCF_E_NCFE9_SHIFT                   (9U)
#define FCCU_NCF_E_NCFE9_WIDTH                   (1U)
#define FCCU_NCF_E_NCFE9(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE9_SHIFT)) & FCCU_NCF_E_NCFE9_MASK)

#define FCCU_NCF_E_NCFE10_MASK                   (0x400U)
#define FCCU_NCF_E_NCFE10_SHIFT                  (10U)
#define FCCU_NCF_E_NCFE10_WIDTH                  (1U)
#define FCCU_NCF_E_NCFE10(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE10_SHIFT)) & FCCU_NCF_E_NCFE10_MASK)

#define FCCU_NCF_E_NCFE11_MASK                   (0x800U)
#define FCCU_NCF_E_NCFE11_SHIFT                  (11U)
#define FCCU_NCF_E_NCFE11_WIDTH                  (1U)
#define FCCU_NCF_E_NCFE11(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE11_SHIFT)) & FCCU_NCF_E_NCFE11_MASK)

#define FCCU_NCF_E_NCFE12_MASK                   (0x1000U)
#define FCCU_NCF_E_NCFE12_SHIFT                  (12U)
#define FCCU_NCF_E_NCFE12_WIDTH                  (1U)
#define FCCU_NCF_E_NCFE12(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE12_SHIFT)) & FCCU_NCF_E_NCFE12_MASK)

#define FCCU_NCF_E_NCFE13_MASK                   (0x2000U)
#define FCCU_NCF_E_NCFE13_SHIFT                  (13U)
#define FCCU_NCF_E_NCFE13_WIDTH                  (1U)
#define FCCU_NCF_E_NCFE13(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE13_SHIFT)) & FCCU_NCF_E_NCFE13_MASK)

#define FCCU_NCF_E_NCFE14_MASK                   (0x4000U)
#define FCCU_NCF_E_NCFE14_SHIFT                  (14U)
#define FCCU_NCF_E_NCFE14_WIDTH                  (1U)
#define FCCU_NCF_E_NCFE14(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE14_SHIFT)) & FCCU_NCF_E_NCFE14_MASK)

#define FCCU_NCF_E_NCFE15_MASK                   (0x8000U)
#define FCCU_NCF_E_NCFE15_SHIFT                  (15U)
#define FCCU_NCF_E_NCFE15_WIDTH                  (1U)
#define FCCU_NCF_E_NCFE15(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_E_NCFE15_SHIFT)) & FCCU_NCF_E_NCFE15_MASK)
/*! @} */

/*! @name NCF_TOE - Non-critical-Fault Alarm-State Timeout Enable */
/*! @{ */

#define FCCU_NCF_TOE_NCFTOE0_MASK                (0x1U)
#define FCCU_NCF_TOE_NCFTOE0_SHIFT               (0U)
#define FCCU_NCF_TOE_NCFTOE0_WIDTH               (1U)
#define FCCU_NCF_TOE_NCFTOE0(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE0_SHIFT)) & FCCU_NCF_TOE_NCFTOE0_MASK)

#define FCCU_NCF_TOE_NCFTOE1_MASK                (0x2U)
#define FCCU_NCF_TOE_NCFTOE1_SHIFT               (1U)
#define FCCU_NCF_TOE_NCFTOE1_WIDTH               (1U)
#define FCCU_NCF_TOE_NCFTOE1(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE1_SHIFT)) & FCCU_NCF_TOE_NCFTOE1_MASK)

#define FCCU_NCF_TOE_NCFTOE2_MASK                (0x4U)
#define FCCU_NCF_TOE_NCFTOE2_SHIFT               (2U)
#define FCCU_NCF_TOE_NCFTOE2_WIDTH               (1U)
#define FCCU_NCF_TOE_NCFTOE2(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE2_SHIFT)) & FCCU_NCF_TOE_NCFTOE2_MASK)

#define FCCU_NCF_TOE_NCFTOE3_MASK                (0x8U)
#define FCCU_NCF_TOE_NCFTOE3_SHIFT               (3U)
#define FCCU_NCF_TOE_NCFTOE3_WIDTH               (1U)
#define FCCU_NCF_TOE_NCFTOE3(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE3_SHIFT)) & FCCU_NCF_TOE_NCFTOE3_MASK)

#define FCCU_NCF_TOE_NCFTOE4_MASK                (0x10U)
#define FCCU_NCF_TOE_NCFTOE4_SHIFT               (4U)
#define FCCU_NCF_TOE_NCFTOE4_WIDTH               (1U)
#define FCCU_NCF_TOE_NCFTOE4(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE4_SHIFT)) & FCCU_NCF_TOE_NCFTOE4_MASK)

