zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FCCU.h
#define FCCU_NCF_TOE_NCFTOE5_MASK                (0x20U)
#define FCCU_NCF_TOE_NCFTOE5_SHIFT               (5U)
#define FCCU_NCF_TOE_NCFTOE5_WIDTH               (1U)
#define FCCU_NCF_TOE_NCFTOE5(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE5_SHIFT)) & FCCU_NCF_TOE_NCFTOE5_MASK)

#define FCCU_NCF_TOE_NCFTOE6_MASK                (0x40U)
#define FCCU_NCF_TOE_NCFTOE6_SHIFT               (6U)
#define FCCU_NCF_TOE_NCFTOE6_WIDTH               (1U)
#define FCCU_NCF_TOE_NCFTOE6(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE6_SHIFT)) & FCCU_NCF_TOE_NCFTOE6_MASK)

#define FCCU_NCF_TOE_NCFTOE7_MASK                (0x80U)
#define FCCU_NCF_TOE_NCFTOE7_SHIFT               (7U)
#define FCCU_NCF_TOE_NCFTOE7_WIDTH               (1U)
#define FCCU_NCF_TOE_NCFTOE7(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE7_SHIFT)) & FCCU_NCF_TOE_NCFTOE7_MASK)

#define FCCU_NCF_TOE_NCFTOE8_MASK                (0x100U)
#define FCCU_NCF_TOE_NCFTOE8_SHIFT               (8U)
#define FCCU_NCF_TOE_NCFTOE8_WIDTH               (1U)
#define FCCU_NCF_TOE_NCFTOE8(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE8_SHIFT)) & FCCU_NCF_TOE_NCFTOE8_MASK)

#define FCCU_NCF_TOE_NCFTOE9_MASK                (0x200U)
#define FCCU_NCF_TOE_NCFTOE9_SHIFT               (9U)
#define FCCU_NCF_TOE_NCFTOE9_WIDTH               (1U)
#define FCCU_NCF_TOE_NCFTOE9(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE9_SHIFT)) & FCCU_NCF_TOE_NCFTOE9_MASK)

#define FCCU_NCF_TOE_NCFTOE10_MASK               (0x400U)
#define FCCU_NCF_TOE_NCFTOE10_SHIFT              (10U)
#define FCCU_NCF_TOE_NCFTOE10_WIDTH              (1U)
#define FCCU_NCF_TOE_NCFTOE10(x)                 (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE10_SHIFT)) & FCCU_NCF_TOE_NCFTOE10_MASK)

#define FCCU_NCF_TOE_NCFTOE11_MASK               (0x800U)
#define FCCU_NCF_TOE_NCFTOE11_SHIFT              (11U)
#define FCCU_NCF_TOE_NCFTOE11_WIDTH              (1U)
#define FCCU_NCF_TOE_NCFTOE11(x)                 (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE11_SHIFT)) & FCCU_NCF_TOE_NCFTOE11_MASK)

#define FCCU_NCF_TOE_NCFTOE12_MASK               (0x1000U)
#define FCCU_NCF_TOE_NCFTOE12_SHIFT              (12U)
#define FCCU_NCF_TOE_NCFTOE12_WIDTH              (1U)
#define FCCU_NCF_TOE_NCFTOE12(x)                 (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE12_SHIFT)) & FCCU_NCF_TOE_NCFTOE12_MASK)

#define FCCU_NCF_TOE_NCFTOE13_MASK               (0x2000U)
#define FCCU_NCF_TOE_NCFTOE13_SHIFT              (13U)
#define FCCU_NCF_TOE_NCFTOE13_WIDTH              (1U)
#define FCCU_NCF_TOE_NCFTOE13(x)                 (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE13_SHIFT)) & FCCU_NCF_TOE_NCFTOE13_MASK)

#define FCCU_NCF_TOE_NCFTOE14_MASK               (0x4000U)
#define FCCU_NCF_TOE_NCFTOE14_SHIFT              (14U)
#define FCCU_NCF_TOE_NCFTOE14_WIDTH              (1U)
#define FCCU_NCF_TOE_NCFTOE14(x)                 (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE14_SHIFT)) & FCCU_NCF_TOE_NCFTOE14_MASK)

#define FCCU_NCF_TOE_NCFTOE15_MASK               (0x8000U)
#define FCCU_NCF_TOE_NCFTOE15_SHIFT              (15U)
#define FCCU_NCF_TOE_NCFTOE15_WIDTH              (1U)
#define FCCU_NCF_TOE_NCFTOE15(x)                 (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TOE_NCFTOE15_SHIFT)) & FCCU_NCF_TOE_NCFTOE15_MASK)
/*! @} */

/*! @name NCF_TO - Non-critical-Fault Alarm-State Timeout Interval */
/*! @{ */

#define FCCU_NCF_TO_TO_MASK                      (0xFFFFFFFFU)
#define FCCU_NCF_TO_TO_SHIFT                     (0U)
#define FCCU_NCF_TO_TO_WIDTH                     (32U)
#define FCCU_NCF_TO_TO(x)                        (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_TO_TO_SHIFT)) & FCCU_NCF_TO_TO_MASK)
/*! @} */

/*! @name CFG_TO - Configuration-State Timeout Interval */
/*! @{ */

#define FCCU_CFG_TO_TO_MASK                      (0x7U)
#define FCCU_CFG_TO_TO_SHIFT                     (0U)
#define FCCU_CFG_TO_TO_WIDTH                     (3U)
#define FCCU_CFG_TO_TO(x)                        (((uint32_t)(((uint32_t)(x)) << FCCU_CFG_TO_TO_SHIFT)) & FCCU_CFG_TO_TO_MASK)
/*! @} */

/*! @name EINOUT - IO Control */
/*! @{ */

#define FCCU_EINOUT_EOUT0_MASK                   (0x1U)
#define FCCU_EINOUT_EOUT0_SHIFT                  (0U)
#define FCCU_EINOUT_EOUT0_WIDTH                  (1U)
#define FCCU_EINOUT_EOUT0(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_EINOUT_EOUT0_SHIFT)) & FCCU_EINOUT_EOUT0_MASK)

#define FCCU_EINOUT_EOUT1_MASK                   (0x2U)
#define FCCU_EINOUT_EOUT1_SHIFT                  (1U)
#define FCCU_EINOUT_EOUT1_WIDTH                  (1U)
#define FCCU_EINOUT_EOUT1(x)                     (((uint32_t)(((uint32_t)(x)) << FCCU_EINOUT_EOUT1_SHIFT)) & FCCU_EINOUT_EOUT1_MASK)

#define FCCU_EINOUT_EIN0_MASK                    (0x10U)
#define FCCU_EINOUT_EIN0_SHIFT                   (4U)
#define FCCU_EINOUT_EIN0_WIDTH                   (1U)
#define FCCU_EINOUT_EIN0(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_EINOUT_EIN0_SHIFT)) & FCCU_EINOUT_EIN0_MASK)

#define FCCU_EINOUT_EIN1_MASK                    (0x20U)
#define FCCU_EINOUT_EIN1_SHIFT                   (5U)
#define FCCU_EINOUT_EIN1_WIDTH                   (1U)
#define FCCU_EINOUT_EIN1(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_EINOUT_EIN1_SHIFT)) & FCCU_EINOUT_EIN1_MASK)
/*! @} */

/*! @name STAT - Status */
/*! @{ */

#define FCCU_STAT_STATUS_MASK                    (0x7U)
#define FCCU_STAT_STATUS_SHIFT                   (0U)
#define FCCU_STAT_STATUS_WIDTH                   (3U)
#define FCCU_STAT_STATUS(x)                      (((uint32_t)(((uint32_t)(x)) << FCCU_STAT_STATUS_SHIFT)) & FCCU_STAT_STATUS_MASK)

#define FCCU_STAT_ESTAT_MASK                     (0x8U)
#define FCCU_STAT_ESTAT_SHIFT                    (3U)
#define FCCU_STAT_ESTAT_WIDTH                    (1U)
#define FCCU_STAT_ESTAT(x)                       (((uint32_t)(((uint32_t)(x)) << FCCU_STAT_ESTAT_SHIFT)) & FCCU_STAT_ESTAT_MASK)

