zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FCCU.h
#define FCCU_IRQ_ALARM_EN_IRQEN7_MASK            (0x80U)
#define FCCU_IRQ_ALARM_EN_IRQEN7_SHIFT           (7U)
#define FCCU_IRQ_ALARM_EN_IRQEN7_WIDTH           (1U)
#define FCCU_IRQ_ALARM_EN_IRQEN7(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN7_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN7_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN8_MASK            (0x100U)
#define FCCU_IRQ_ALARM_EN_IRQEN8_SHIFT           (8U)
#define FCCU_IRQ_ALARM_EN_IRQEN8_WIDTH           (1U)
#define FCCU_IRQ_ALARM_EN_IRQEN8(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN8_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN8_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN9_MASK            (0x200U)
#define FCCU_IRQ_ALARM_EN_IRQEN9_SHIFT           (9U)
#define FCCU_IRQ_ALARM_EN_IRQEN9_WIDTH           (1U)
#define FCCU_IRQ_ALARM_EN_IRQEN9(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN9_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN9_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN10_MASK           (0x400U)
#define FCCU_IRQ_ALARM_EN_IRQEN10_SHIFT          (10U)
#define FCCU_IRQ_ALARM_EN_IRQEN10_WIDTH          (1U)
#define FCCU_IRQ_ALARM_EN_IRQEN10(x)             (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN10_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN10_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN11_MASK           (0x800U)
#define FCCU_IRQ_ALARM_EN_IRQEN11_SHIFT          (11U)
#define FCCU_IRQ_ALARM_EN_IRQEN11_WIDTH          (1U)
#define FCCU_IRQ_ALARM_EN_IRQEN11(x)             (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN11_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN11_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN12_MASK           (0x1000U)
#define FCCU_IRQ_ALARM_EN_IRQEN12_SHIFT          (12U)
#define FCCU_IRQ_ALARM_EN_IRQEN12_WIDTH          (1U)
#define FCCU_IRQ_ALARM_EN_IRQEN12(x)             (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN12_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN12_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN13_MASK           (0x2000U)
#define FCCU_IRQ_ALARM_EN_IRQEN13_SHIFT          (13U)
#define FCCU_IRQ_ALARM_EN_IRQEN13_WIDTH          (1U)
#define FCCU_IRQ_ALARM_EN_IRQEN13(x)             (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN13_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN13_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN14_MASK           (0x4000U)
#define FCCU_IRQ_ALARM_EN_IRQEN14_SHIFT          (14U)
#define FCCU_IRQ_ALARM_EN_IRQEN14_WIDTH          (1U)
#define FCCU_IRQ_ALARM_EN_IRQEN14(x)             (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN14_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN14_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN15_MASK           (0x8000U)
#define FCCU_IRQ_ALARM_EN_IRQEN15_SHIFT          (15U)
#define FCCU_IRQ_ALARM_EN_IRQEN15_WIDTH          (1U)
#define FCCU_IRQ_ALARM_EN_IRQEN15(x)             (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN15_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN15_MASK)
/*! @} */

/*! @name NMI_EN - Non-critical Fault-State Non-maskable-Interrupt-Request Enable */
/*! @{ */

#define FCCU_NMI_EN_NMIEN0_MASK                  (0x1U)
#define FCCU_NMI_EN_NMIEN0_SHIFT                 (0U)
#define FCCU_NMI_EN_NMIEN0_WIDTH                 (1U)
#define FCCU_NMI_EN_NMIEN0(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN0_SHIFT)) & FCCU_NMI_EN_NMIEN0_MASK)

#define FCCU_NMI_EN_NMIEN1_MASK                  (0x2U)
#define FCCU_NMI_EN_NMIEN1_SHIFT                 (1U)
#define FCCU_NMI_EN_NMIEN1_WIDTH                 (1U)
#define FCCU_NMI_EN_NMIEN1(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN1_SHIFT)) & FCCU_NMI_EN_NMIEN1_MASK)

#define FCCU_NMI_EN_NMIEN2_MASK                  (0x4U)
#define FCCU_NMI_EN_NMIEN2_SHIFT                 (2U)
#define FCCU_NMI_EN_NMIEN2_WIDTH                 (1U)
#define FCCU_NMI_EN_NMIEN2(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN2_SHIFT)) & FCCU_NMI_EN_NMIEN2_MASK)

#define FCCU_NMI_EN_NMIEN3_MASK                  (0x8U)
#define FCCU_NMI_EN_NMIEN3_SHIFT                 (3U)
#define FCCU_NMI_EN_NMIEN3_WIDTH                 (1U)
#define FCCU_NMI_EN_NMIEN3(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN3_SHIFT)) & FCCU_NMI_EN_NMIEN3_MASK)

#define FCCU_NMI_EN_NMIEN4_MASK                  (0x10U)
#define FCCU_NMI_EN_NMIEN4_SHIFT                 (4U)
#define FCCU_NMI_EN_NMIEN4_WIDTH                 (1U)
#define FCCU_NMI_EN_NMIEN4(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN4_SHIFT)) & FCCU_NMI_EN_NMIEN4_MASK)

#define FCCU_NMI_EN_NMIEN5_MASK                  (0x20U)
#define FCCU_NMI_EN_NMIEN5_SHIFT                 (5U)
#define FCCU_NMI_EN_NMIEN5_WIDTH                 (1U)
#define FCCU_NMI_EN_NMIEN5(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN5_SHIFT)) & FCCU_NMI_EN_NMIEN5_MASK)

#define FCCU_NMI_EN_NMIEN6_MASK                  (0x40U)
#define FCCU_NMI_EN_NMIEN6_SHIFT                 (6U)
#define FCCU_NMI_EN_NMIEN6_WIDTH                 (1U)
#define FCCU_NMI_EN_NMIEN6(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN6_SHIFT)) & FCCU_NMI_EN_NMIEN6_MASK)

#define FCCU_NMI_EN_NMIEN7_MASK                  (0x80U)
#define FCCU_NMI_EN_NMIEN7_SHIFT                 (7U)
#define FCCU_NMI_EN_NMIEN7_WIDTH                 (1U)
#define FCCU_NMI_EN_NMIEN7(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN7_SHIFT)) & FCCU_NMI_EN_NMIEN7_MASK)

#define FCCU_NMI_EN_NMIEN8_MASK                  (0x100U)
#define FCCU_NMI_EN_NMIEN8_SHIFT                 (8U)
#define FCCU_NMI_EN_NMIEN8_WIDTH                 (1U)
#define FCCU_NMI_EN_NMIEN8(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN8_SHIFT)) & FCCU_NMI_EN_NMIEN8_MASK)

#define FCCU_NMI_EN_NMIEN9_MASK                  (0x200U)
#define FCCU_NMI_EN_NMIEN9_SHIFT                 (9U)
#define FCCU_NMI_EN_NMIEN9_WIDTH                 (1U)
#define FCCU_NMI_EN_NMIEN9(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN9_SHIFT)) & FCCU_NMI_EN_NMIEN9_MASK)

#define FCCU_NMI_EN_NMIEN10_MASK                 (0x400U)
#define FCCU_NMI_EN_NMIEN10_SHIFT                (10U)
#define FCCU_NMI_EN_NMIEN10_WIDTH                (1U)
#define FCCU_NMI_EN_NMIEN10(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN10_SHIFT)) & FCCU_NMI_EN_NMIEN10_MASK)

