zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FCCU.h
#define FCCU_NMI_EN_NMIEN11_MASK                 (0x800U)
#define FCCU_NMI_EN_NMIEN11_SHIFT                (11U)
#define FCCU_NMI_EN_NMIEN11_WIDTH                (1U)
#define FCCU_NMI_EN_NMIEN11(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN11_SHIFT)) & FCCU_NMI_EN_NMIEN11_MASK)

#define FCCU_NMI_EN_NMIEN12_MASK                 (0x1000U)
#define FCCU_NMI_EN_NMIEN12_SHIFT                (12U)
#define FCCU_NMI_EN_NMIEN12_WIDTH                (1U)
#define FCCU_NMI_EN_NMIEN12(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN12_SHIFT)) & FCCU_NMI_EN_NMIEN12_MASK)

#define FCCU_NMI_EN_NMIEN13_MASK                 (0x2000U)
#define FCCU_NMI_EN_NMIEN13_SHIFT                (13U)
#define FCCU_NMI_EN_NMIEN13_WIDTH                (1U)
#define FCCU_NMI_EN_NMIEN13(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN13_SHIFT)) & FCCU_NMI_EN_NMIEN13_MASK)

#define FCCU_NMI_EN_NMIEN14_MASK                 (0x4000U)
#define FCCU_NMI_EN_NMIEN14_SHIFT                (14U)
#define FCCU_NMI_EN_NMIEN14_WIDTH                (1U)
#define FCCU_NMI_EN_NMIEN14(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN14_SHIFT)) & FCCU_NMI_EN_NMIEN14_MASK)

#define FCCU_NMI_EN_NMIEN15_MASK                 (0x8000U)
#define FCCU_NMI_EN_NMIEN15_SHIFT                (15U)
#define FCCU_NMI_EN_NMIEN15_WIDTH                (1U)
#define FCCU_NMI_EN_NMIEN15(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN15_SHIFT)) & FCCU_NMI_EN_NMIEN15_MASK)
/*! @} */

/*! @name EOUT_SIG_EN - Non-critical Fault-State EOUT Signaling Enable */
/*! @{ */

#define FCCU_EOUT_SIG_EN_EOUTEN0_MASK            (0x1U)
#define FCCU_EOUT_SIG_EN_EOUTEN0_SHIFT           (0U)
#define FCCU_EOUT_SIG_EN_EOUTEN0_WIDTH           (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN0(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN0_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN0_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN1_MASK            (0x2U)
#define FCCU_EOUT_SIG_EN_EOUTEN1_SHIFT           (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN1_WIDTH           (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN1(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN1_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN1_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN2_MASK            (0x4U)
#define FCCU_EOUT_SIG_EN_EOUTEN2_SHIFT           (2U)
#define FCCU_EOUT_SIG_EN_EOUTEN2_WIDTH           (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN2(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN2_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN2_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN3_MASK            (0x8U)
#define FCCU_EOUT_SIG_EN_EOUTEN3_SHIFT           (3U)
#define FCCU_EOUT_SIG_EN_EOUTEN3_WIDTH           (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN3(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN3_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN3_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN4_MASK            (0x10U)
#define FCCU_EOUT_SIG_EN_EOUTEN4_SHIFT           (4U)
#define FCCU_EOUT_SIG_EN_EOUTEN4_WIDTH           (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN4(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN4_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN4_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN5_MASK            (0x20U)
#define FCCU_EOUT_SIG_EN_EOUTEN5_SHIFT           (5U)
#define FCCU_EOUT_SIG_EN_EOUTEN5_WIDTH           (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN5(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN5_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN5_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN6_MASK            (0x40U)
#define FCCU_EOUT_SIG_EN_EOUTEN6_SHIFT           (6U)
#define FCCU_EOUT_SIG_EN_EOUTEN6_WIDTH           (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN6(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN6_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN6_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN7_MASK            (0x80U)
#define FCCU_EOUT_SIG_EN_EOUTEN7_SHIFT           (7U)
#define FCCU_EOUT_SIG_EN_EOUTEN7_WIDTH           (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN7(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN7_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN7_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN8_MASK            (0x100U)
#define FCCU_EOUT_SIG_EN_EOUTEN8_SHIFT           (8U)
#define FCCU_EOUT_SIG_EN_EOUTEN8_WIDTH           (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN8(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN8_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN8_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN9_MASK            (0x200U)
#define FCCU_EOUT_SIG_EN_EOUTEN9_SHIFT           (9U)
#define FCCU_EOUT_SIG_EN_EOUTEN9_WIDTH           (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN9(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN9_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN9_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN10_MASK           (0x400U)
#define FCCU_EOUT_SIG_EN_EOUTEN10_SHIFT          (10U)
#define FCCU_EOUT_SIG_EN_EOUTEN10_WIDTH          (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN10(x)             (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN10_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN10_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN11_MASK           (0x800U)
#define FCCU_EOUT_SIG_EN_EOUTEN11_SHIFT          (11U)
#define FCCU_EOUT_SIG_EN_EOUTEN11_WIDTH          (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN11(x)             (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN11_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN11_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN12_MASK           (0x1000U)
#define FCCU_EOUT_SIG_EN_EOUTEN12_SHIFT          (12U)
#define FCCU_EOUT_SIG_EN_EOUTEN12_WIDTH          (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN12(x)             (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN12_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN12_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN13_MASK           (0x2000U)
#define FCCU_EOUT_SIG_EN_EOUTEN13_SHIFT          (13U)
#define FCCU_EOUT_SIG_EN_EOUTEN13_WIDTH          (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN13(x)             (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN13_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN13_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN14_MASK           (0x4000U)
#define FCCU_EOUT_SIG_EN_EOUTEN14_SHIFT          (14U)
#define FCCU_EOUT_SIG_EN_EOUTEN14_WIDTH          (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN14(x)             (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN14_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN14_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN15_MASK           (0x8000U)
#define FCCU_EOUT_SIG_EN_EOUTEN15_SHIFT          (15U)
#define FCCU_EOUT_SIG_EN_EOUTEN15_WIDTH          (1U)
#define FCCU_EOUT_SIG_EN_EOUTEN15(x)             (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN15_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN15_MASK)
/*! @} */

/*! @name TMR_ALARM - Alarm-State Timer */
/*! @{ */

#define FCCU_TMR_ALARM_COUNT_MASK                (0xFFFFFFFFU)
#define FCCU_TMR_ALARM_COUNT_SHIFT               (0U)
#define FCCU_TMR_ALARM_COUNT_WIDTH               (32U)
#define FCCU_TMR_ALARM_COUNT(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_TMR_ALARM_COUNT_SHIFT)) & FCCU_TMR_ALARM_COUNT_MASK)
/*! @} */

/*! @name TMR_CFG - Configuration-State Timer */
/*! @{ */

#define FCCU_TMR_CFG_COUNT_MASK                  (0xFFFFFFFFU)
#define FCCU_TMR_CFG_COUNT_SHIFT                 (0U)
#define FCCU_TMR_CFG_COUNT_WIDTH                 (32U)
#define FCCU_TMR_CFG_COUNT(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_TMR_CFG_COUNT_SHIFT)) & FCCU_TMR_CFG_COUNT_MASK)
/*! @} */

/*! @name TMR_ETMR - Fault-Output Timer */
/*! @{ */

#define FCCU_TMR_ETMR_COUNT_MASK                 (0xFFFFFFFFU)
#define FCCU_TMR_ETMR_COUNT_SHIFT                (0U)
#define FCCU_TMR_ETMR_COUNT_WIDTH                (32U)
#define FCCU_TMR_ETMR_COUNT(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_TMR_ETMR_COUNT_SHIFT)) & FCCU_TMR_ETMR_COUNT_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group FCCU_Register_Masks */

/*!
 * @}
 */ /* end of group FCCU_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K39_FCCU_H_) */
